; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	thermograph3 - mode
	thermograph0 - mode
	image1 - mode
	thermograph2 - mode
	GroundStation5 - direction
	Star10 - direction
	GroundStation4 - direction
	Star0 - direction
	GroundStation7 - direction
	Star2 - direction
	Star1 - direction
	GroundStation3 - direction
	Star9 - direction
	Star11 - direction
	Star6 - direction
	GroundStation8 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument2 thermograph2)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star2)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 Star2)
	(supports instrument4 image1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument5 image1)
	(supports instrument5 thermograph2)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 Star11)
	(calibration_target instrument5 GroundStation7)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 Star1)
	(calibration_target instrument6 Star11)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 Star6)
	(supports instrument8 image1)
	(supports instrument8 thermograph3)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation8)
	(calibration_target instrument8 Star6)
	(calibration_target instrument8 Star11)
	(calibration_target instrument8 Star9)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star16)
)
(:goal (and
	(pointing satellite2 GroundStation7)
	(pointing satellite3 GroundStation5)
	(have_image Planet12 thermograph0)
	(have_image Planet13 thermograph3)
	(have_image Planet14 image1)
	(have_image Planet15 thermograph3)
	(have_image Star16 thermograph0)
))

)

; plan
1. (turn_to satellite3 groundstation8 star16)
   deleted: (pointing satellite3 star16)
   added: (pointing satellite3 groundstation8)
   goals met: 0 of 7
2. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 7
3. (calibrate satellite3 instrument8 groundstation8)
   added: (calibrated instrument8)
   goals met: 0 of 7
4. (turn_to satellite3 planet14 groundstation8)
   deleted: (pointing satellite3 groundstation8)
   added: (pointing satellite3 planet14)
   goals met: 0 of 7
5. (take_image satellite3 planet14 instrument8 image1)
   added: (have_image planet14 image1)
   goals met: 1 of 7
6. (turn_to satellite3 planet13 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 planet13)
   goals met: 1 of 7
7. (take_image satellite3 planet13 instrument8 thermograph3)
   added: (have_image planet13 thermograph3)
   goals met: 2 of 7
8. (turn_to satellite3 planet12 planet13)
   deleted: (pointing satellite3 planet13)
   added: (pointing satellite3 planet12)
   goals met: 2 of 7
9. (take_image satellite3 planet12 instrument8 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 3 of 7
10. (turn_to satellite2 groundstation7 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 groundstation7)
   goals met: 4 of 7
11. (turn_to satellite3 planet15 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 planet15)
   goals met: 4 of 7
12. (take_image satellite3 planet15 instrument8 thermograph3)
   added: (have_image planet15 thermograph3)
   goals met: 5 of 7
13. (turn_to satellite3 star16 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 star16)
   goals met: 5 of 7
14. (take_image satellite3 star16 instrument8 thermograph0)
   added: (have_image star16 thermograph0)
   goals met: 6 of 7
15. (turn_to satellite3 groundstation5 star16)
   deleted: (pointing satellite3 star16)
   added: (pointing satellite3 groundstation5)
   goals met: 7 of 7
